## Pandas Series with Python Lists

In [2]:
import pandas as pd
import numpy as np

In [3]:
a = [1, 2, 3, 4, 5, 6]

In [4]:
series = pd.Series(a)
print(series[(series > 2) & (series * series == 2)]) 
# ! -> | or & required mandatorily not "and" or "or"
print(series, type(series))

Series([], dtype: int64)
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64 <class 'pandas.core.series.Series'>

In [5]:
custom_index = pd.Series(a, index=["a", "b", "c", "d", "e", "f"], name="Alphabet")
custom_index

a    1
b    2
c    3
d    4
e    5
f    6
Name: Alphabet, dtype: int64

In [6]:
empty = pd.Series([])
empty

Series([], dtype: object)

In [7]:
scalar_series = pd.Series(0.5, index= [1, 2, 3, 4])
scalar_series # filled with the same value i.e. 0.5

1    0.5
2    0.5
3    0.5
4    0.5
dtype: float64

In [8]:
dict_series = pd.Series({"Gaurav": [1, 2, 3], "Prasad": 99, "Great": np.arange(30, 20, step=-3)})
dict_series

Gaurav           [1, 2, 3]
Prasad                  99
Great     [30, 27, 24, 21]
dtype: object

### Operations on Series

In [9]:
dict_series[0:1] # 0th row

Gaurav    [1, 2, 3]
dtype: object

In [10]:
max(scalar_series), scalar_series.min()

(0.5, 0.5)

## Using DataFrames

In [11]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [12]:
a = [1, 2, 3, 4, 5, 6]
df = pd.DataFrame(a)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

### Using Arrays or Numpy Array

In [13]:
a = np.arange(20).reshape(4, 5)
df = pd.DataFrame(a, index = ["a", "b", "c", "d"], columns = ["col1", "col2", "col3", "col4", "col5"])
print(df)

   col1  col2  col3  col4  col5
a     0     1     2     3     4
b     5     6     7     8     9
c    10    11    12    13    14
d    15    16    17    18    19

### Using Dictionary

In [14]:
dic = [{"a": 5, "b": 3, "c": 14}, {"c": 10, "b": 15}]
df = pd.DataFrame(dic)
df

     a   b   c
0  5.0   3  14
1  NaN  15  10

### Using Series

In [15]:
b = {"RollNo": pd.Series([1, 2, 3, 4, 5]),  "Age": pd.Series([20, 13, 13, 18, 41])}

df = pd.DataFrame(b)
df

   RollNo  Age
0       1   20
1       2   13
2       3   13
3       4   18
4       5   41

### Reading CSV

In [ ]:
df = pd.read_csv("./DataSet.csv")
# We can specify the index column as well like "Roll No" or "Reg No"
df.head()

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
0,FERRARI,SF90 STRADALE,V8,3990 cc,963 hp,340 km/h,2.5 sec,"$1,100,000",plug in hyrbrid,2,800 Nm
1,ROLLS ROYCE,PHANTOM,V12,6749 cc,563 hp,250 km/h,5.3 sec,"$460,000",Petrol,5,900 Nm
2,Ford,KA+,1.2L Petrol,"1,200 cc",70-85 hp,165 km/h,10.5 sec,"$12,000-$15,000",Petrol,5,100 - 140 Nm
3,MERCEDES,GT 63 S,V8,"3,982 cc",630 hp,250 km/h,3.2 sec,"$161,000",Petrol,4,900 Nm
4,AUDI,AUDI R8 Gt,V10,"5,204 cc",602 hp,320 km/h,3.6 sec,"$253,290",Petrol,2,560 Nm

### Operations on DataFrame

In [17]:
df.columns # all columns

Index(['Company Names', 'Cars Names', 'Engines', 'CC/Battery Capacity',
       'HorsePower', 'Total Speed', 'Performance(0 - 100 )KM/H', 'Cars Prices',
       'Fuel Types', 'Seats', 'Torque'],
      dtype='object')

In [18]:
print(df.shape) # shape of DataFrame
print(df.size) # rows * cols -> total cells

(1213, 11)
13343

In [19]:
df.head() # Gives first 5 rows
df.tail(6) # Gives last 6 rows
df.describe()

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
count,1213,1213,1213,1210,1213,1213,1207,1213,1213,1213,1212
unique,36,1196,351,306,452,114,177,531,20,19,259
top,Nissan,Panamera Platinum Edition,I4,1984 cc,355 hp,250 km/h,6.5 sec,"$35,000",Petrol,5,400 Nm
freq,149,2,64,31,23,145,45,36,871,688,72

In [20]:
df.isnull() # -> tell if we have null values in DataFrame
df.isnull().sum() # Tells us how many null values are there in each column
df.isnull().sum().sum() # Tells us how many null values are total

10

In [21]:
#  To drop all the not null rows in a DataFrame ->
notNullDA = df.dropna(inplace=False) # default axis 0 # Inplace can be "True"
notNullDA.isnull().sum()

Company Names                0
Cars Names                   0
Engines                      0
CC/Battery Capacity          0
HorsePower                   0
Total Speed                  0
Performance(0 - 100 )KM/H    0
Cars Prices                  0
Fuel Types                   0
Seats                        0
Torque                       0
dtype: int64

In [22]:
df.fillna({"Company Names" : "Unknown", "Engine": "Something"})

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
0,FERRARI,SF90 STRADALE,V8,3990 cc,963 hp,340 km/h,2.5 sec,"$1,100,000",plug in hyrbrid,2,800 Nm
1,ROLLS ROYCE,PHANTOM,V12,6749 cc,563 hp,250 km/h,5.3 sec,"$460,000",Petrol,5,900 Nm
2,Ford,KA+,1.2L Petrol,"1,200 cc",70-85 hp,165 km/h,10.5 sec,"$12,000-$15,000",Petrol,5,100 - 140 Nm
3,MERCEDES,GT 63 S,V8,"3,982 cc",630 hp,250 km/h,3.2 sec,"$161,000",Petrol,4,900 Nm
4,AUDI,AUDI R8 Gt,V10,"5,204 cc",602 hp,320 km/h,3.6 sec,"$253,290",Petrol,2,560 Nm
...,...,...,...,...,...,...,...,...,...,...,...
1208,Mazda,Bongo Truck,2.0L Inline-4,"1,998 cc",120 hp,130 km/h,15.0 sec,"$15,000 - $18,000",Petrol,2,150 Nm
1209,Mazda,Rotary Pickup,1.3L Wankel Rotary Engine,"1,308 cc",130 hp,150 km/h,14.5 sec,"$18,000 - $22,000",Petrol,2,160 Nm
1210,Mazda,Luce Rotary Coupe,1.3L Wankel Rotary Engine,"1,308 cc",135 hp,175 km/h,12.0 sec,"$25,000 - $30,000",Petrol,4,180 Nm
1211,Mazda,Millenia S,2.5L V6,"2,500 cc",200 hp,220 km/h,8.0 sec,"$30,000 - $35,000",Petrol,5,250 Nm
1212,Mazda,787B (Race Car),2.6L Wankel Rotary Engine,"2,620 cc",700 hp,320 km/h,3.5 sec,"$5,000,000 - $7,000,000",Petrol,1,500 Nm

In [23]:
df.fillna({"Company Names" : df["Company Names"].mode()[0]}) # filling with the most frequent value

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
0,FERRARI,SF90 STRADALE,V8,3990 cc,963 hp,340 km/h,2.5 sec,"$1,100,000",plug in hyrbrid,2,800 Nm
1,ROLLS ROYCE,PHANTOM,V12,6749 cc,563 hp,250 km/h,5.3 sec,"$460,000",Petrol,5,900 Nm
2,Ford,KA+,1.2L Petrol,"1,200 cc",70-85 hp,165 km/h,10.5 sec,"$12,000-$15,000",Petrol,5,100 - 140 Nm
3,MERCEDES,GT 63 S,V8,"3,982 cc",630 hp,250 km/h,3.2 sec,"$161,000",Petrol,4,900 Nm
4,AUDI,AUDI R8 Gt,V10,"5,204 cc",602 hp,320 km/h,3.6 sec,"$253,290",Petrol,2,560 Nm
...,...,...,...,...,...,...,...,...,...,...,...
1208,Mazda,Bongo Truck,2.0L Inline-4,"1,998 cc",120 hp,130 km/h,15.0 sec,"$15,000 - $18,000",Petrol,2,150 Nm
1209,Mazda,Rotary Pickup,1.3L Wankel Rotary Engine,"1,308 cc",130 hp,150 km/h,14.5 sec,"$18,000 - $22,000",Petrol,2,160 Nm
1210,Mazda,Luce Rotary Coupe,1.3L Wankel Rotary Engine,"1,308 cc",135 hp,175 km/h,12.0 sec,"$25,000 - $30,000",Petrol,4,180 Nm
1211,Mazda,Millenia S,2.5L V6,"2,500 cc",200 hp,220 km/h,8.0 sec,"$30,000 - $35,000",Petrol,5,250 Nm
1212,Mazda,787B (Race Car),2.6L Wankel Rotary Engine,"2,620 cc",700 hp,320 km/h,3.5 sec,"$5,000,000 - $7,000,000",Petrol,1,500 Nm

In [24]:
df.replace(to_replace="MERCEDES", value="MERCEDES Benz") # replaces all values in the DataFrame
# ? You can give to_replace as a [...] which replaces all the items with value 
# ? to_replace = [...] and value = [...] it will replace in order

df["CC/Battery Capacity"].replace # replace in a col

<bound method NDFrame.replace of 0        3990 cc
1        6749 cc
2       1,200 cc
3       3,982 cc
4       5,204 cc
          ...
1208    1,998 cc
1209    1,308 cc
1210    1,308 cc
1211    2,500 cc
1212    2,620 cc
Name: CC/Battery Capacity, Length: 1213, dtype: object>

### loc

In [25]:
df.loc[0] # to get a row of index value
df.loc[3:8]
df.loc[[1, 3, 9, 100]]
df.loc[30:40, "CC/Battery Capacity"] # gives row number and then col
df.loc[df["CC/Battery Capacity"].str.len() < 30] # expression also works
df.loc[df["CC/Battery Capacity"].str.len() < 30, ["Company Names", "Torque"]] # Gives me company names and torque of those whose len < 30

     Company Names        Torque
0          FERRARI        800 Nm
1      ROLLS ROYCE        900 Nm
2             Ford  100 - 140 Nm
3         MERCEDES        900 Nm
4             AUDI        560 Nm
...            ...           ...
1208         Mazda        150 Nm
1209         Mazda        160 Nm
1210         Mazda        180 Nm
1211         Mazda        250 Nm
1212         Mazda        500 Nm

[1193 rows x 2 columns]

## iloc / loc
* in loc function we had to select by using the index rows it can be by roll number or id but in iloc it's always by index

In [26]:
df.iloc[3] # 3rd index row
df.iloc[[1, 39, 69]] #gives all the rows at the given indexes
df.iloc[0:5, 1:5] # row 0 to 4 and column 1 to 4

      Cars Names      Engines CC/Battery Capacity HorsePower
0  SF90 STRADALE           V8             3990 cc     963 hp
1        PHANTOM          V12             6749 cc     563 hp
2            KA+  1.2L Petrol            1,200 cc   70-85 hp
3        GT 63 S           V8            3,982 cc     630 hp
4     AUDI R8 Gt          V10            5,204 cc     602 hp

## GroupBy

In [33]:
branch_gp = df.groupby(by="Company Names")
print(branch_gp) # Group object
print(branch_gp.groups) # all the groups

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000019DB5483770>

In [57]:
branch_gp.get_group("AUDI").head()

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
4,AUDI,AUDI R8 Gt,V10,"5,204 cc",602 hp,320 km/h,3.6 sec,"$253,290",Petrol,2,560 Nm
122,AUDI,R8 V10 PLUS,V10,"5,204 cc",610 hp,330 km/h,3.2 sec,"$194,000",Petrol,2,560 Nm
123,AUDI,RS7 SPORTBACK,V8,"3,993 cc",591 hp,305 km/h,3.6 sec,"$114,000",Petrol,5,800 Nm
124,AUDI,S8,V8,"3,993 cc",563 hp,305 km/h,4.3 sec,"$101,000",Petrol,5,800 Nm
125,AUDI,RS6 AVANT,V8,"3,993 cc",591 hp,305 km/h,3.6 sec,"$109,000",Petrol,5,800 Nm

In [59]:
audi = branch_gp.get_group("AUDI")
audi[audi.Seats == audi.Seats.max()] # max seats

,Company Names,Cars Names,Engines,CC/Battery Capacity,HorsePower,Total Speed,Performance(0 - 100 )KM/H,Cars Prices,Fuel Types,Seats,Torque
132,AUDI,Q7,V6,"2,995 cc",335 hp,250 km/h,6.3 sec,"$60,000",Petrol,7,600 Nm

In [ ]:
max_seats = df.loc[branch_gp["Seats"].idxmax()].head()
max_seats

In [83]:
# # ? Iterating over groups
for group_name, dataframe in branch_gp:
    temp = branch_gp.get_group(group_name)
    max_seats_in_each_group = temp.loc[temp.Seats == temp.Seats.max(), ["Company Names", "Cars Names", "Seats"]].head(1)
    print(max_seats_in_each_group, "\n")

   Company Names Cars Names Seats
37  ASTON MARTIN        DBX     5

    Company Names Cars Names Seats
132          AUDI         Q7     7

    Company Names   Cars Names Seats
941         Acura  MDX Advance     7

  Company Names            Cars Names Seats
7       BENTLEY  Continental GT Azure     4

   Company Names Cars Names Seats
99           BMW      M5 CS     5

    Company Names Cars Names Seats
880       Bugatti     Chiron     2

    Company Names Cars Names Seats
642      Cadillac   Escalade     7

    Company Names Cars Names Seats
712     Chevrolet   Suburban     8

   Company Names Cars Names Seats
11       FERRARI  PORTOFINO   2+2

     Company Names  Cars Names Seats
1023          Ford  Expedition     8

    Company Names Cars Names Seats
763           GMC      Yukon     8

    Company Names Cars Names Seats
197         HONDA      PILOT     8

    Company Names Cars Names Seats
250       HYUNDAI   SANTA FE     7

         Company Names Cars Names Seats
900  Jaguar Land Rover  Jaguar XE     5

    Company Names Cars Names Seats
677          Jeep   Wagoneer     8

    Company Names   Cars Names Seats
177           KIA  SPORTAGE LX     5

    Company Names               Cars Names Seats
195         KIA    SPORTAGE 2024(BASE FWD)     5

    Company Names   Cars Names Seats
834           Kia  Carnival EX     8

   Company Names Cars Names Seats
47   LAMBORGHINI      URUS      5

    Company Names Cars Names Seats
225      MAHINDRA     XUV500     7

     Company Names Cars Names Seats
228  MARUTI SUZUKI      SWIFT     5

   Company Names          Cars Names Seats
79      MERCEDES  BENZ S-CLASS S 580     5

     Company Names Cars Names Seats
1134         Mazda       CX-8     7

     Company Names Cars Names Seats
1069    Mitsubishi  Outlander     7

   Company Names  Cars Names Seats
29        NISSAN  PATHFINDER     7

    Company Names Cars Names Seats
387        Nissan     Armada     8

    Company Names Cars Names Seats
971       Peugeot       5008     7

    Company Names Cars Names Seats
538       Porsche    Cayenne     5

  Company Names Cars Names Seats
1   ROLLS ROYCE    PHANTOM     5

   Company Names Cars Names Seats
65  ROLLS ROYCE       GHOST     5

   Company Names           Cars Names Seats
20        TOYOTA  TOYOTA LAND CRUISER     7

    Company Names Cars Names Seats
651   Tata Motors     Safari     7

    Company Names Cars Names Seats
663         Tesla    Model X     7

    Company Names Cars Names Seats
174         VOLVO       XC90     7

    Company Names   Cars Names Seats
327    Volkswagen  Transporter     9

    Company Names Cars Names Seats
890         Volvo   Volvo FH     2

In [ ]:
gp = df.loc[0:10, :].groupby(by=["Company Names", "Engines"])
print(gp.groups) # it will give all permutations of groups formed by company name and engines

### Map And apply

In [93]:
data = pd.Series([1, 2, 3, 4, 5])
result = data.map(lambda x: x**2)
print(result)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [100]:
data = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Apply function column-wise (default `axis=0`)
result = data.apply(lambda x: x.sum(), axis=0)
print(result)

# Apply function row-wise (`axis=1`)
result = data.apply(lambda x: x.sum(), axis=1)
print(result)

A     6
B    15
dtype: int64
0    5
1    7
2    9
dtype: int64

type